// 7.1 Хоосон зайг нөхнө үү.
// a) Бүх скриптийг гурван төрлийн удирдлагын илэрхийллээр бичиж болно. Эдгээр нь:
// Шугаман, Салаалсан, Давталттай юм.
// b) Логик опероторууд хоёр сонголтын илэрхийлэл нь нөхцөл үнэн бол нэг үйлдлийг, худал бол  нөгөө үйлдлийг тус тус гүйцэтгэнэ.
// c) Бүлэг илэрхийллүүдийг заасан тооны удаа давтаж гүйцэтгэх давталтыг  for  давталт гэнэ.
// d) Давталтыг хэдэн удаа гүйцэтгэхийг урьдчилан мэдэгдээгүй үед break утгыг давталтыг зогсооход ашиглаж болно.


// 7.2 Тоон төрөлтэй х хувьсагч дээр 1-г нэмэх дөрвөн ялгаатай жаваскрипт илэрхийлэл бичнэ үү.
// Нэг арга
x = 10;
a = x + 1;
console.log(a);
// Хоёрдох арга
b = ++x;
console.log(b);
// Гуравдах арга
value1 = 1;
value2 = 1;
console.log(value1 + value2);
// Дөрөвдөх арга
var c;
c = 1;
document.writeln(++c);


// 7.3 Дараах даалгавруудыг биелүүлэх жаваскрипт илэрхийллүүд бичнэ үү.
// a) х ба y-ийн нийлбэрийг z-т олгоод дараа нь x-ийн утгыг 1-ээр нэмэгдүүлнэ. Зөвхөн нэг илэрхийлэл бичнэ үү.
var x = 2;
var y = 3;
z = (x + y,  (++y));
console.log(z);

// b) count хувьсагчийн утгыг 10-аас их эсэхийг шалга. Хэрэв үнэн бол "10-аас их" гэж хэвлэ.
var count = 5;
if (count > 10) {
      console.log("10 aas ih")
} else {
      console.log ("10 aas baga")
}
// c) х хувьсагчийг 1-р хорогдуулаад дараа нь total хувьсагчаас хас. Зөвхөн нэг илэрхийлэл
// бичнэ үү.
x =  parseInt(prompt("too:"));
total = 23;
a = total-(x-1);
console.log(a);

// d) q-г divisor хувьсагчаар хуваасан үлдэгдлийг олоод q-д хадгал. Энэ илэрхийллийг хоёр өөр
// аргаар бодно уу
var q = parseInt(prompt("Utga:"));
var a = q/2;
console.log(a);

var a = 22/2;
document.writeln(a);

// 7.4 Дараах даалгавруудыг биелүүлэх жаваскрипт илэрхийллүүдийг бичнэ үү.
// a) sum ба х хувьсагчдыг зарла.
// b) х хувьсагчид 1-г олго
// c) sum хувьсагчид 0-г олго.
// d) sum хувьсагч дээр х хувьсагчыг нэмж, үр дүнг sum хувьсагчид олго.
// e) Дараах форматаар хэвлэ. "Нийлбэр нь: (sum хувьсагчийн утгыг оруулах)"
var x=1;
var sum=0;
sum+=x;
console.log("Niilber ni:" + sum);

// 7.5 7.4-р дасгал дээр бичсэн илэрхийллүүдийг болон while давталтыг ашиглан 1-ээс 10 хүртэлх
// бүхэл тоонуудын нийлбэрийг олох скрипт бич.
var total = 0, count = 1;
while (count <= 10) {
    total += count;
    count += 1;
}
console.log(total);

// 7.6 Дараах илэрхийллүүд биелсний дараа хувьсагч бүрийн утга хэд байхыг тодорхойл. Илэрхийлэл
// бүр эхлэхэд хувьсагчийн утгууд 5 байна.
// a)
var product = 5;
 product *= ++x;
 console.log(product);
//  huvisagch utga:30
// b)  
var quotient = 5 ;
quotient /= ++x;
console.log(quotient);
//  huvisagch utga:0.7142857142857143

// 7.7 Доорх кодны хэсэг бүрийн алдааг олж зас.
// // a) 
while ( c <= 5 ) { 
      product *= c; 
++c;

// Zassan huvilbar
while (c<=5){
       product*=++c;
}

// b)
if ( gender == 1 )
document.writeln( "Woman" );
else;
document.writeln( "Man" );

// Zassan huvilbar
if(gender==1){
      document.writeln("Woman");
}else{
      document.writeln("Man");
}


// 7.8 While давталтын алдааг олно уу?
while ( z >= 0 )
      sum += z; 

// Aldaag zassan ni:
while(z>=0){
      sum +=z;
}